In [64]:
import numpy as np
import pandas as pd

In [65]:
df = pd.DataFrame({
    'Population': [6543,987,673,543],
    'GDP':[
        90050,
        87654,
        3652,
        9385
    ],
    'Exports':[67,64,234,65],
    'Surface Area': [23,53,64,21],
    'HDI':[
        34,
        34,
        65,
        78
    ],
    'Continents':[
        'Asia',
        'North America',
        'Svoiet',
        'South America'
    ]
}, columns=['Population','GDP','Exports','Surface Area','HDI'], index = ['Continents','BAS','ASD','popl'])

In [66]:
# Countries
df.index = [
        'Japan',
        'America',
        'Russia',
        'Brazil'
]

In [67]:
df.info()
# Gets the structure of the dataframe. Use to quickly define /find columns with missing values.

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Japan to Brazil
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    4 non-null      int64
 1   GDP           4 non-null      int64
 2   Exports       4 non-null      int64
 3   Surface Area  4 non-null      int64
 4   HDI           4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [68]:
df.describe()# QUick Summary statstics

        Population           GDP     Exports  Surface Area        HDI
count     4.000000      4.000000    4.000000      4.000000   4.000000
mean   2186.500000  47685.250000  107.500000     40.250000  52.750000
std    2910.307372  47602.903535   84.342555     21.561926  22.291628
min     543.000000   3652.000000   64.000000     21.000000  34.000000
25%     640.500000   7951.750000   64.750000     22.500000  34.000000
50%     830.000000  48519.500000   66.000000     38.000000  49.500000
75%    2376.000000  88253.000000  108.750000     55.750000  68.250000
max    6543.000000  90050.000000  234.000000     64.000000  78.000000

In [30]:
df.dtypes.value_counts()

int64    5
Name: count, dtype: int64

In [31]:
df

         Population    GDP  Exports  Surface Area  HDI
Japan          6543  90050       67            23   34
America         987  87654       64            53   34
Russia          673   3652      234            64   65
Brazil          543   9385       65            21   78

In [47]:
# df['Population']
df[["GDP","Surface Area"]].abs()

           GDP  Surface Area
Japan    90050            23
America  87654            53
Russia    3652            64
Brazil    9385            21

In [ ]:
df[["GDP","Surface Area"]]

<bound method Series.mean of Japan      90050
America    87654
Russia      3652
Brazil      9385
Name: GDP, dtype: int64>

In [ ]:
# We use iloc for sequential positioning and 
# df.iloc[-2] 
df.loc['Russia']

Population       673
GDP             3652
Exports          234
Surface Area      64
HDI               65
Name: Russia, dtype: int64

In [69]:
df

         Population    GDP  Exports  Surface Area  HDI
Japan          6543  90050       67            23   34
America         987  87654       64            53   34
Russia          673   3652      234            64   65
Brazil          543   9385       65            21   78

In [71]:
df.loc["Japan":"Russia", "Exports"]

Japan       67
America     64
Russia     234
Name: Exports, dtype: int64

In [72]:
df.loc["America":"Brazil", "GDP":"Surface Area"]

           GDP  Exports  Surface Area
America  87654       64            53
Russia    3652      234            64
Brazil    9385       65            21

In [74]:
df.iloc[::1, 1:3]

           GDP  Exports
Japan    90050       67
America  87654       64
Russia    3652      234
Brazil    9385       65

In [ ]:
df.iloc[[0,1,2]]
# 0 is Japan, 1 is AMerica, 2 is RUssia

         Population    GDP  Exports  Surface Area  HDI
Japan          6543  90050       67            23   34
America         987  87654       64            53   34
Russia          673   3652      234            64   65

In [80]:
df

         Population    GDP  Exports  Surface Area  HDI
Japan          6543  90050       67            23   34
America         987  87654       64            53   34
Russia          673   3652      234            64   65
Brazil          543   9385       65            21   78

In [82]:
df.iloc[1:3,-1]

America    34
Russia     65
Name: HDI, dtype: int64